src/DataProcessors/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПерспективныеПланы</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПерспективныеПланы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезПриб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезКм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>Внутренняя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэфф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидТовара</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПерспективныеПланы/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтоПолугодие;
ТипПлана = 0;
ТипСправочника = 2;
СортироватьПо = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.СписокГруппМатериалов.Видимость = ?(ТипСправочника = 1,Истина,Ложь);
Элементы.СписокГруппНоменклатуры.Видимость = ?(ТипСправочника = 2,Истина,Ложь); 
Элементы.СписокЛинеек.Видимость = ?(ТипСправочника = 2,Истина,Ложь);
Элементы.СписокПроектов.Видимость = ТипПлана;
Элементы.РезервКомплектовМПЗ.Видимость = Не ТипПлана; 
Элементы.РезервПриборов.Видимость = Не ТипПлана;
Элементы.СортироватьПо.Видимость = ТипПлана;
Элементы.ВыбратьВсе.Видимость = ТипПлана;
Элементы.ОтменитьВсе.Видимость = ТипПлана;
Элементы.ОбнулитьПомеченные.Видимость = ТипПлана;
Элементы.Изменить.Доступность = МожноРедактировать();
Элементы.Загрузить.Доступность = МожноРедактировать();
	Если ТипПлана Тогда
	РезервКомплектовМПЗ = Ложь;
	РезервПриборов = Ложь;
	Иначе
	СортироватьПо = 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МожноРедактировать()
	Если РольДоступна("Администратор")или РольДоступна("Планирование")или РольДоступна("Отгрузка") Тогда
	Возврат(Истина);
	Иначе	
	Возврат(Ложь);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПоказатьППНаСервере()
ТЗ = Новый ТаблицаЗначений;
СписокДат = Новый СписокЗначений;
Запрос = Новый Запрос;

	Если ТипСправочника = 1 Тогда
	ТЗ.Колонки.Добавить("Пометка",Новый ОписаниеТипов("Булево"),"П.");
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыМПЗ"),"Ст.");
	ТЗ.Колонки.Добавить("Стандартный",Новый ОписаниеТипов("Булево"),"Стд.");
	ТЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"),"Проект");
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Материалы"),"Номенклатура");
	ТЗ.Колонки.Добавить("Замена",Новый ОписаниеТипов("СправочникСсылка.Материалы"),"Замена");
	ТЗ.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),"Цена посл. зак.");
	ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)),"Наименование");
	//ТЗ.Колонки.Добавить("ПиковыеПродажи",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)),"Пик. прод.");
	Иначе
	ТЗ.Колонки.Добавить("Пометка",Новый ОписаниеТипов("Булево"),"П.");
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыСпецификаций"),"Ст.");
	ТЗ.Колонки.Добавить("Стандартный",Новый ОписаниеТипов("Булево"),"Стд.");
	ТЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"),"Проект");
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура");
	ТЗ.Колонки.Добавить("Замена",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Замена");
	ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)),"Наименование");
	//ТЗ.Колонки.Добавить("ПиковыеПродажи",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)),"Пик. прод.");
	КонецЕсли;
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		ТЗ.Колонки.Добавить("Д"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)),Формат(ТекДата,"ДФ=MM.yy"));
			Если РезервПриборов Тогда
			ТЗ.Колонки.Добавить("РП"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)),"РП-"+Формат(ТекДата,"ДФ=MM.yy"));	
			КонецЕсли;
				Если РезервКомплектовМПЗ Тогда
				ТЗ.Колонки.Добавить("РК"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)),"РК-"+Формат(ТекДата,"ДФ=MM.yy"));	
				КонецЕсли;	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПерспективныеПланы.Период,
	|	ПерспективныеПланы.МПЗ КАК МПЗ,
	|	ПерспективныеПланы.Проект,
	|	ПерспективныеПланы.Количество,
	|	ПерспективныеПланы.РезПриб,
	|	ПерспективныеПланы.РезКм,
	|	СтатусыМПЗСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.ПерспективныеПланы КАК ПерспективныеПланы
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПО ПерспективныеПланы.МПЗ = СтатусыМПЗСрезПоследних.МПЗ
	|ГДЕ
	|	ПерспективныеПланы.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПерспективныеПланы.МПЗ В ИЕРАРХИИ(&СписокГруппНоменклатуры)
	|	И ПерспективныеПланы.Количество > 0";
	Если ТипСправочника = 1 Тогда
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппМатериалов);
	Иначе
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
		Если СписокЛинеек.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.МПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
		Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
		КонецЕсли;
	КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Статус) Тогда
		Запрос.Текст = Запрос.Текст + " И СтатусыМПЗСрезПоследних.Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", Объект.Статус);
		КонецЕсли;
			Если ТипПлана Тогда
				Если СписокПроектов.Количество() > 0 Тогда
				Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект В(&СписокПроектов)";
				Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);				
				Иначе	
				Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект <> &ПустойПроект";
				Запрос.УстановитьПараметр("ПустойПроект", Справочники.Проекты.ПустаяСсылка());				
				КонецЕсли;
			Иначе
			Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект = &ПустойПроект";
			Запрос.УстановитьПараметр("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
			КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО МПЗ"; 
Запрос.УстановитьПараметр("ДатаНач", Объект.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Объект.Период.ДатаОкончания);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл
		Если ТипСправочника = 2 Тогда
			Если ТипИзделий = 1 Тогда
				Если Найти(ВыборкаМПЗ.МПЗ.Наименование,"_Х") > 0 Тогда
				Продолжить;
				КонецЕсли;	
			ИначеЕсли ТипИзделий = 2 Тогда
				Если Найти(ВыборкаМПЗ.МПЗ.Наименование,"_Х") = 0 Тогда
				Продолжить;
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	ВыборкаПП = ВыборкаМПЗ.Выбрать();
		Пока ВыборкаПП.Следующий() Цикл
		НомСтр = СписокДат.НайтиПоЗначению(ВыборкаПП.Период).ПолучитьИдентификатор()+1;
		ВыбТЧ = ТЗ.НайтиСтроки(Новый Структура("Номенклатура,Проект",ВыборкаМПЗ.МПЗ,ВыборкаПП.Проект));
			Если ВыбТЧ.Количество() = 0 Тогда
			ТЧ = ТЗ.Добавить();
			ТЧ.Статус = ВыборкаПП.Статус;		
			ТЧ.Номенклатура = ВыборкаМПЗ.МПЗ;
			ТЧ.Наименование = глНаименованиеВСкобкахБезЭтапа(ВыборкаМПЗ.МПЗ.Наименование);
			ТЧ.Проект = ВыборкаПП.Проект;
				Если ЗначениеЗаполнено(ВыборкаМПЗ.МПЗ.Товар) Тогда
				ТЧ.Стандартный = ВыборкаМПЗ.МПЗ.Товар.Стандартный;
				КонецЕсли;
					Если ТипСправочника = 1 Тогда	
					ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаМПЗ.МПЗ,Объект.Период.ДатаОкончания);
					КонецЕсли;
			//ТЧ.ПиковыеПродажи = ВыборкаМПЗ.МПЗ.ПиковыеПродажи;
			ТЧ["Д"+НомСтр] = ВыборкаПП.Количество;
				Если РезервПриборов Тогда
				ТЧ["РП"+НомСтр] = ВыборкаПП.РезПриб;	
				КонецЕсли;
					Если РезервКомплектовМПЗ Тогда
					ТЧ["РК"+НомСтр] = ВыборкаПП.РезКм;	
					КонецЕсли;				
			Иначе	
			ВыбТЧ[0]["Д"+НомСтр] = ВыборкаПП.Количество;
				Если РезервПриборов Тогда
				ВыбТЧ[0]["РП"+НомСтр] = ВыборкаПП.РезПриб;	
				КонецЕсли;
					Если РезервКомплектовМПЗ Тогда
					ВыбТЧ[0]["РК"+НомСтр] = ВыборкаПП.РезКм;	
					КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		ТЗ.Сортировать("Наименование");	
		Иначе
		ТЗ.Сортировать("Проект");	
		КонецЕсли; 
МассивРеквизитов = Новый Массив;
МассивУдаляемыхРеквизитов = Новый Массив;

МассивРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("ТаблицаЗначений"), "", "Номенклатура"));
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя = "Наименование" Тогда
		Продолжить;
		КонецЕсли; 
    МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Номенклатура", Колонка.Заголовок)); 
	КонецЦикла;
МассивУдаляемыхРеквизитов.Добавить("Номенклатура");
	Если Элементы.Найти("Номенклатура") <> Неопределено Тогда
	Элементы.Удалить(Элементы["Номенклатура"]);
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);
	КонецЕсли;
ИзменитьРеквизиты(МассивРеквизитов);
//Помещаем Элементы на форму 
Таблица = Элементы.Добавить("Номенклатура", Тип("ТаблицаФормы")); 
Таблица.ПутьКДанным = "Номенклатура"; 
Таблица.Отображение = ОтображениеТаблицы.Список;
Таблица.ЧередованиеЦветовСтрок = Истина;
Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
Таблица.КонтекстноеМеню.Доступность = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя = "Наименование" Тогда
		Продолжить;
		КонецЕсли; 
    НовыйЭлемент = Элементы.Добавить("Номенклатура_" + Колонка.Имя, Тип("ПолеФормы"), Таблица);
		Если Колонка.Имя = "Пометка" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		ИначеЕсли Колонка.Имя = "Стандартный" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Проект" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Статус" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Номенклатура" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.КнопкаОчистки = Ложь;
		НовыйЭлемент.КнопкаРегулирования = Ложь;
		НовыйЭлемент.КнопкаОткрытия = Истина;
		НовыйЭлемент.КнопкаСоздания = Ложь;	
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;	
		Иначе	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;   
    НовыйЭлемент.ПутьКДанным = "Номенклатура." + Колонка.Имя;
		Если (Найти(Колонка.Имя,"РП") > 0) Тогда
		НовыйЭлемент.ЦветФона = Новый Цвет(251,249,236);		
		ИначеЕсли (Найти(Колонка.Имя,"РК") > 0) Тогда
		НовыйЭлемент.ЦветФона = Новый Цвет(248,242,216);		
		КонецЕсли; 
	КонецЦикла;
//переносим таблицу значений на форму 
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
Массив = ТЗ.ВыгрузитьКолонку("Номенклатура");
	Для к = 0 по Массив.ВГраница() Цикл	
	СписокНоменклатуры.Добавить(Массив[к]);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьВсеНаСервере()
ТЗ = Новый ТаблицаЗначений;
СписокДат = Новый СписокЗначений;
Запрос = Новый Запрос;

	Если ТипСправочника = 1 Тогда
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыМПЗ"),"Ст.");
	ТЗ.Колонки.Добавить("Стандартный",Новый ОписаниеТипов("Булево"),"Стд.");
	ТЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"),"Проект");
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Материалы"),"Номенклатура");
	ТЗ.Колонки.Добавить("Замена",Новый ОписаниеТипов("СправочникСсылка.Материалы"),"Замена");
	ТЗ.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),"Цена посл. зак.");
	ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)),"Наименование");
	//ТЗ.Колонки.Добавить("ПиковыеПродажи",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)),"Пик. прод.");
	Иначе
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыСпецификаций"),"Ст.");
	ТЗ.Колонки.Добавить("Стандартный",Новый ОписаниеТипов("Булево"),"Стд.");
	ТЗ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"),"Проект");
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура");
	ТЗ.Колонки.Добавить("Замена",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Замена");
	ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)),"Наименование");
	//ТЗ.Колонки.Добавить("ПиковыеПродажи",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)),"Пик. прод.");
	КонецЕсли;
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		ТЗ.Колонки.Добавить("Д"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)),Формат(ТекДата,"ДФ=MM.yy"));
			Если РезервПриборов Тогда
			ТЗ.Колонки.Добавить("РП"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)),"РП-"+Формат(ТекДата,"ДФ=MM.yy"));	
			КонецЕсли;
				Если РезервКомплектовМПЗ Тогда
				ТЗ.Колонки.Добавить("РК"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)),"РК-"+Формат(ТекДата,"ДФ=MM.yy"));	
				КонецЕсли;	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
		Если ТипСправочника = 1 Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка,
			|	Номенклатура.Товар,
			|	СтатусыМПЗСрезПоследних.Статус
			|ИЗ
			|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
			|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Материалы КАК Номенклатура
			|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
			|ГДЕ
			|	Номенклатура.Родитель В ИЕРАРХИИ(&СписокГруппМатериалов)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
		Запрос.УстановитьПараметр("СписокГруппМатериалов", СписокГруппМатериалов);
		Иначе	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка,
			|	Номенклатура.Товар,
			|	СтатусыМПЗСрезПоследних.Статус
			|ИЗ
			|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
			|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
			|ГДЕ
			|	Номенклатура.Родитель В ИЕРАРХИИ(&СписокГруппНоменклатуры)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
		Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
		КонецЕсли; 
			Если ЗначениеЗаполнено(Объект.Статус) Тогда
			Запрос.Текст = Запрос.Текст + " И СтатусыМПЗСрезПоследних.Статус = &Статус";
			Запрос.УстановитьПараметр("Статус", Объект.Статус);
			КонецЕсли;  
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипСправочника = 2 Тогда
			Если ТипИзделий = 1 Тогда
				Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Наименование,"_Х") > 0 Тогда
				Продолжить;
				КонецЕсли;	
			ИначеЕсли ТипИзделий = 2 Тогда
				Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Наименование,"_Х") = 0 Тогда
				Продолжить;
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	ТЧ = ТЗ.Добавить();
	ТЧ.Статус = ВыборкаДетальныеЗаписи.Статус;		
	ТЧ.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.Наименование = глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Товар) Тогда
		ТЧ.Стандартный = ВыборкаДетальныеЗаписи.Товар.Стандартный;
		КонецЕсли;
			Если ТипСправочника = 1 Тогда	
			ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаДетальныеЗаписи.Ссылка,Объект.Период.ДатаОкончания);
			КонецЕсли;  
				Для Каждого Период Из СписокДат Цикл
				НомСтр = Период.ПолучитьИдентификатор()+1;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПерспективныеПланы.МПЗ,
					|	ПерспективныеПланы.Проект,
					|	ПерспективныеПланы.Количество,
					|	ПерспективныеПланы.РезПриб,
					|	ПерспективныеПланы.РезКм
					|ИЗ
					|	РегистрСведений.ПерспективныеПланы КАК ПерспективныеПланы
					|ГДЕ
					|	ПерспективныеПланы.Период = &Период
					|	И ПерспективныеПланы.МПЗ = &МПЗ";
					Если СписокЛинеек.Количество() > 0 Тогда
					Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.МПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
					Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
					КонецЕсли;
						Если ТипПлана Тогда
							Если СписокПроектов.Количество() > 0 Тогда
							Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект В(&СписокПроектов)";
							Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);				
							Иначе	
							Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект <> &ПустойПроект";
							Запрос.УстановитьПараметр("ПустойПроект", Справочники.Проекты.ПустаяСсылка());				
							КонецЕсли;
						Иначе
						Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.Проект = &ПустойПроект";
						Запрос.УстановитьПараметр("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
						КонецЕсли; 
				Запрос.УстановитьПараметр("Период", Период.Значение);
				Запрос.УстановитьПараметр("МПЗ", ВыборкаДетальныеЗаписи.Ссылка);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаПП = РезультатЗапроса.Выбрать();
					Пока ВыборкаПП.Следующий() Цикл
					ВыбТЧ = ТЗ.НайтиСтроки(Новый Структура("Номенклатура,Проект",ВыборкаДетальныеЗаписи.Ссылка,ВыборкаПП.Проект));
						Если ВыбТЧ.Количество() = 0 Тогда
						ТЧ = ТЗ.Добавить();
						ТЧ.Статус = ВыборкаДетальныеЗаписи.Статус;		
						ТЧ.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
						ТЧ.Наименование = глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование);
						ТЧ.Проект = ВыборкаПП.Проект;
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Товар) Тогда
							ТЧ.Стандартный = ВыборкаДетальныеЗаписи.Товар.Стандартный;
							КонецЕсли;
								Если ТипСправочника = 1 Тогда	
								ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаДетальныеЗаписи.Ссылка,Объект.Период.ДатаОкончания);
								КонецЕсли;
						//ТЧ.ПиковыеПродажи = ВыборкаДетальныеЗаписи.Ссылка.ПиковыеПродажи;
						ТЧ["Д"+НомСтр] = ВыборкаПП.Количество;
							Если РезервПриборов Тогда
							ТЧ["РП"+НомСтр] = ВыборкаПП.РезПриб;	
							КонецЕсли;
								Если РезервКомплектовМПЗ Тогда
								ТЧ["РК"+НомСтр] = ВыборкаПП.РезКм;	
								КонецЕсли;				
						Иначе	
						ВыбТЧ[0]["Д"+НомСтр] = ВыборкаПП.Количество;
							Если РезервПриборов Тогда
							ВыбТЧ[0]["РП"+НомСтр] = ВыборкаПП.РезПриб;	
							КонецЕсли;
								Если РезервКомплектовМПЗ Тогда
								ВыбТЧ[0]["РК"+НомСтр] = ВыборкаПП.РезКм;	
								КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;	
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		ТЗ.Сортировать("Наименование");	
		Иначе
		ТЗ.Сортировать("Проект");	
		КонецЕсли; 
МассивРеквизитов = Новый Массив;
МассивУдаляемыхРеквизитов = Новый Массив;

МассивРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("ТаблицаЗначений"), "", "Номенклатура"));
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя = "Наименование" Тогда
		Продолжить;
		КонецЕсли; 
    МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Номенклатура", Колонка.Заголовок)); 
	КонецЦикла;
МассивУдаляемыхРеквизитов.Добавить("Номенклатура");
	Если Элементы.Найти("Номенклатура") <> Неопределено Тогда
	Элементы.Удалить(Элементы["Номенклатура"]);
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);
	КонецЕсли;
ИзменитьРеквизиты(МассивРеквизитов);
//Помещаем Элементы на форму 
Таблица = Элементы.Добавить("Номенклатура", Тип("ТаблицаФормы")); 
Таблица.ПутьКДанным = "Номенклатура"; 
Таблица.Отображение = ОтображениеТаблицы.Список;
Таблица.ЧередованиеЦветовСтрок = Истина;
Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
Таблица.КонтекстноеМеню.Доступность = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя = "Наименование" Тогда
		Продолжить;
		КонецЕсли; 
    НовыйЭлемент = Элементы.Добавить("Номенклатура_" + Колонка.Имя, Тип("ПолеФормы"), Таблица);
		Если Колонка.Имя = "Стандартный" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Проект" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Статус" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Номенклатура" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.КнопкаОчистки = Ложь;
		НовыйЭлемент.КнопкаРегулирования = Ложь;
		НовыйЭлемент.КнопкаОткрытия = Истина;
		НовыйЭлемент.КнопкаСоздания = Ложь;	
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;	
		Иначе	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;   
    НовыйЭлемент.ПутьКДанным = "Номенклатура." + Колонка.Имя;
		Если (Найти(Колонка.Имя,"РП") > 0) Тогда
		НовыйЭлемент.ЦветФона = Новый Цвет(251,249,236);		
		ИначеЕсли (Найти(Колонка.Имя,"РК") > 0) Тогда
		НовыйЭлемент.ЦветФона = Новый Цвет(248,242,216);		
		КонецЕсли; 
	КонецЦикла;
//переносим таблицу значений на форму 
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
Массив = ТЗ.ВыгрузитьКолонку("Номенклатура");
	Для к = 0 по Массив.ВГраница() Цикл	
	СписокНоменклатуры.Добавить(Массив[к]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПП(Команда)
	Если ТипСправочника = 1 Тогда
		Если СписокГруппМатериалов.Количество() = 0 Тогда
		Сообщить("Выберите группы материалов!");
		Возврат;
		КонецЕсли; 
	Иначе
		Если СписокГруппНоменклатуры.Количество() = 0 Тогда
		Сообщить("Выберите группы номенклатуры!");
		Возврат;
		КонецЕсли;
	КонецЕсли;
		Если Объект.ТолькоПП Тогда
		ПоказатьППНаСервере();
		Иначе	
		ПоказатьВсеНаСервере();		
		КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ТипСправочникаПриИзменении(Элемент)
Элементы.СписокГруппМатериалов.Видимость = ?(ТипСправочника = 1,Истина,Ложь);
Элементы.СписокГруппНоменклатуры.Видимость = ?(ТипСправочника = 2,Истина,Ложь);	
	Если ТипСправочника = 1 Тогда
	Элементы.ТипИзделий.Доступность = Ложь;
	Иначе
	Элементы.ТипИзделий.Доступность = Истина;
	КонецЕсли;
Объект.Статус = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаМесяц(Команда)
ОткрытьФормуМодально("Обработка.ПерспективныеПланы.Форма.ФормаЗагрузки",Новый Структура("Проектный,ТипСправочника,СписокРассылки",ТипПлана,ТипСправочника,СписокПочтовойРассылки.ВыгрузитьЗначения()));
КонецПроцедуры

&НаКлиенте
Функция ПроверитьФайл(Результат,КоличествоМесяцев)
	Попытка
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	НомСтр = 0;
	    Для к = 2 по КолСтрок Цикл
		НомСтр = к; 
		Состояние("Обработка...",к*100/КолСтрок,"Проверка файла...");
			Для л = 2 По КоличествоМесяцев + 1 Цикл
			Кол = Число(ExcelЛист.Cells(к,л).Value);
			КонецЦикла;
		КонецЦикла;
	Исключение
	Сообщить("Ошибка в строке "+НомСтр);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
Возврат(Истина);
КонецФункции 

&НаКлиенте
Процедура ЗагрузитьППЗаПериод(Команда)
ОткрытьФормуМодально("Обработка.ПерспективныеПланы.Форма.ФормаЗагрузки1",Новый Структура("Проектный,ТипСправочника,СписокРассылки",ТипПлана,ТипСправочника,СписокПочтовойРассылки.ВыгрузитьЗначения()));
КонецПроцедуры

&НаСервере
Функция ИзменитьНаСервере()
СЗ = Новый СписокЗначений;
ТабДок = Новый ТабличныйДокумент;

Макет = Обработки.ПерспективныеПланы.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");	
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
 
ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаВывода = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);	
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли; 			
	ТекДата = ТекДата + 86400;
	КонецЦикла;	
		Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
		ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
		ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
		ОблСтрока.Параметры.Проект = СокрЛП(ТЧ.Проект.Наименование);
		Номенклатура = ТЧ.Номенклатура;
		Проект = ТЧ.Проект;
			Если Не ТЧ.Замена.Пустая() Тогда
			Номенклатура = ТЧ.Замена;
			ОблСтрока.Параметры.СтатусНовый = ПолучитьСтатус(ТЧ.Замена);
			ОблСтрока.Параметры.Замена = СокрЛП(ТЧ.Замена); 
			НомСтр = 0;
				Для Каждого Стр Из СЗ Цикл	
				НомСтр = НомСтр + 1;
				ПП = РегистрыСведений.ПерспективныеПланы.Получить(Стр.Значение,Новый Структура("МПЗ,Проект",ТЧ.Номенклатура,ТЧ.Проект));
				флИзменение = Ложь;				
					Если ПП.Количество <> 0 Тогда
					флИзменение = Истина;
					КонецЕсли;
						Если РезервПриборов Тогда
							Если ПП.РезПриб <> 0 Тогда
							флИзменение = Истина;
							КонецЕсли;
						КонецЕсли;
							Если РезервКомплектовМПЗ Тогда
								Если ПП.РезКм <> 0 Тогда
								флИзменение = Истина;
								КонецЕсли;
							КонецЕсли;		
								Если флИзменение Тогда
								ПП = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
								ПП.Период = Стр.Значение;
								ПП.МПЗ = ТЧ.Номенклатура;
								ПП.Проект = ТЧ.Проект;
								ПП.Количество = 0;
									Если РезервПриборов Тогда
									ПП.РезПриб = 0;	
									КонецЕсли;
										Если РезервКомплектовМПЗ Тогда
										ПП.РезКм = 0;	
										КонецЕсли;
								ПП.Записать(Истина);
								КонецЕсли; 
				КонецЦикла;
			КонецЕсли;
		ТабДок.Вывести(ОблСтрока);
			Для Каждого Стр Из СЗ Цикл	
			НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
			ПП = РегистрыСведений.ПерспективныеПланы.Получить(Стр.Значение,Новый Структура("МПЗ,Проект",Номенклатура,Проект));
			флИзменение = Ложь;				
				Если ПП.Количество <> ТЧ["Д"+НомСтр] Тогда
				флИзменение = Истина;
				ОблСтрокаПериод.Параметры.КолППСтарое = ПП.Количество;
				ОблСтрокаПериод.Параметры.КолППНовое = ТЧ["Д"+НомСтр];
				Иначе
				ОблСтрокаПериод.Параметры.КолППСтарое = 0;
				ОблСтрокаПериод.Параметры.КолППНовое = 0;					
				КонецЕсли;
					Если РезервПриборов Тогда
						Если ПП.РезПриб <> ТЧ["РП"+НомСтр] Тогда
						флИзменение = Истина;
						ОблСтрокаПериод.Параметры.КолРПСтарое = ПП.РезПриб;
						ОблСтрокаПериод.Параметры.КолРПНовое = ТЧ["РП"+НомСтр];
						Иначе
						ОблСтрокаПериод.Параметры.КолРПСтарое = 0;
						ОблСтрокаПериод.Параметры.КолРПНовое = 0;
						КонецЕсли;
					КонецЕсли;
						Если РезервКомплектовМПЗ Тогда
							Если ПП.РезКм <> ТЧ["РК"+НомСтр] Тогда
							флИзменение = Истина;
							ОблСтрокаПериод.Параметры.КолРКСтарое = ПП.РезКм;
							ОблСтрокаПериод.Параметры.КолРКНовое = ТЧ["РК"+НомСтр];
							Иначе
							ОблСтрокаПериод.Параметры.КолРКСтарое = 0;
							ОблСтрокаПериод.Параметры.КолРКНовое = 0;
							КонецЕсли;
						КонецЕсли;		
							Если флИзменение Тогда
							ПП = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
							ПП.Период = Стр.Значение;
							ПП.МПЗ = Номенклатура;
							ПП.Проект = Проект;
							ПП.Количество = ТЧ["Д"+НомСтр];
								Если РезервПриборов Тогда
								ПП.РезПриб = ТЧ["РП"+НомСтр];	
								КонецЕсли;
									Если РезервКомплектовМПЗ Тогда
									ПП.РезКм = ТЧ["РК"+НомСтр];	
									КонецЕсли;
							ПП.Записать(Истина);
							КонецЕсли; 		
			ТабДок.Присоединить(ОблСтрокаПериод);
			КонецЦикла;
		КонецЦикла;
ТабДок.Вывести(ОблКонец);
НомСтр = 0;
	Для Каждого Стр Из СЗ Цикл
	НомСтр = НомСтр + 1;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;	
ТабДок.ФиксацияСверху = 5;	
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Изменить(Команда)
ТД = ИзменитьНаСервере();
ТД.Показать("Изменение помесячных перспективных планов");
ПочтоваяРассылка(ТД,Объект.Период.ДатаНачала,Объект.Период.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ОбнулитьПомеченныеНаСервере()
СЗ = Новый СписокЗначений;

ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);	
		КонецЕсли; 			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
		Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
			Если ТЧ.Пометка Тогда	
				Для Каждого Стр Из СЗ Цикл	
				НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
				ПП = РегистрыСведений.ПерспективныеПланы.Получить(Стр.Значение,Новый Структура("МПЗ,Проект",ТЧ.Номенклатура,ТЧ.Проект));
				флИзменение = Ложь;				
					Если ПП.Количество <> 0 Тогда
					флИзменение = Истина;					
					КонецЕсли;
						Если РезервПриборов Тогда
							Если ПП.РезПриб <> 0 Тогда
							флИзменение = Истина;
							КонецЕсли;
						КонецЕсли;
							Если РезервКомплектовМПЗ Тогда
								Если ПП.РезКм <> 0 Тогда
								флИзменение = Истина;
								КонецЕсли;
							КонецЕсли;		
								Если флИзменение Тогда
								ПП = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
								ПП.Период = Стр.Значение;
								ПП.МПЗ = ТЧ.Номенклатура;
								ПП.Проект = ТЧ.Проект;
								ПП.Количество = 0;
								ТЧ["Д"+НомСтр] = 0;
									Если РезервПриборов Тогда
									ПП.РезПриб = 0;
									ТЧ["РП"+НомСтр] = 0;	
									КонецЕсли;
										Если РезервКомплектовМПЗ Тогда
										ПП.РезКм = 0;
										ТЧ["РК"+НомСтр] = 0;		
										КонецЕсли;
								ПП.Записать(Истина);
								КонецЕсли; 		
				КонецЦикла;			
			КонецЕсли; 
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьПомеченные(Команда)
ОбнулитьПомеченныеНаСервере();
КонецПроцедуры

&НаСервере
Функция ВыполнениеППНаСервере()
Запрос = Новый Запрос;
ТабДок = Новый ТабличныйДокумент; 
СЗ = Новый СписокЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ВыполнениеПерспективногоПлана");
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");

ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
	|	ПланыВыпускаОбороты.Период КАК Период,
	|	ПланыВыпускаОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ПланыВыпускаОбороты.КоличествоПриход КАК КоличествоПриход
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Обороты(, , Месяц, ) КАК ПланыВыпускаОбороты
	|ГДЕ
	|	ПланыВыпускаОбороты.Номенклатура В(&СписокНоменклатуры)";
Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
	ОблСтрока.Параметры.Проект = СокрЛП(ТЧ.Проект.Наименование);	
	ТабДок.Вывести(ОблСтрока);
		Для Каждого Стр Из СЗ Цикл	
		НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
		ОблСтрокаПериод.Параметры.Количество = ТЧ["Д"+НомСтр];
		КолСоздано = 0;
		КолВыпущено = 0;
		ВыборкаДетальныеЗаписи.Сбросить();
			Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Номенклатура,Период",ТЧ.Номенклатура,Стр.Значение)) Цикл
			КолСоздано = КолСоздано + ВыборкаДетальныеЗаписи.КоличествоПриход;
			КолВыпущено = КолВыпущено + ВыборкаДетальныеЗаписи.КоличествоРасход;
			КонецЦикла;
		ОблСтрокаПериод.Параметры.КоличествоСоздано = КолСоздано;
		ОблСтрокаПериод.Параметры.КоличествоВыпущено = КолВыпущено;
			Если ОблСтрокаПериод.Параметры.Количество > 0 Тогда
			ОблСтрокаПериод.Параметры.ПроцентЗапусков = ОблСтрокаПериод.Параметры.КоличествоСоздано/ОблСтрокаПериод.Параметры.Количество;
			ОблСтрокаПериод.Параметры.ПроцентВыпусков = ОблСтрокаПериод.Параметры.КоличествоВыпущено/ОблСтрокаПериод.Параметры.Количество;			
			Иначе	
			ОблСтрокаПериод.Параметры.ПроцентЗапусков = 0;
			ОблСтрокаПериод.Параметры.ПроцентВыпусков = 0;			
			КонецЕсли;
		ТабДок.Присоединить(ОблСтрокаПериод);
		КонецЦикла;			
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
	Для Каждого Стр Из СЗ Цикл
	НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
	ОблКонецПериод.Параметры.Количество = ЭтаФорма.Номенклатура.Итог("Д"+НомСтр);
	КолСозданоВсего = 0;
	КолВыпущеноВсего = 0;
	ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Период",Стр.Значение)) Цикл
		КолСозданоВсего = КолСозданоВсего + ВыборкаДетальныеЗаписи.КоличествоПриход;
		КолВыпущеноВсего = КолВыпущеноВсего + ВыборкаДетальныеЗаписи.КоличествоРасход;
		КонецЦикла;
	ОблКонецПериод.Параметры.КоличествоСоздано = КолСозданоВсего;
	ОблКонецПериод.Параметры.КоличествоВыпущено = КолВыпущеноВсего; 
		Если ОблКонецПериод.Параметры.Количество > 0 Тогда
		ОблКонецПериод.Параметры.ПроцентЗапусков = ОблКонецПериод.Параметры.КоличествоСоздано/ОблКонецПериод.Параметры.Количество;
		ОблКонецПериод.Параметры.ПроцентВыпусков = ОблКонецПериод.Параметры.КоличествоВыпущено/ОблКонецПериод.Параметры.Количество;			
		Иначе	
		ОблКонецПериод.Параметры.ПроцентЗапусков = 0;
		ОблКонецПериод.Параметры.ПроцентВыпусков = 0;			
		КонецЕсли;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ВыполнениеПП(Команда)
ТД = ВыполнениеППНаСервере();	 
ТД.Показать("Выполнение перспективного плана за период");
ТД.ФиксацияСлева = 3;
ТД.ФиксацияСверху = 3;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоРеализаций(Продукция,Период)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.Реализация.ТабличнаяЧасть КАК РеализацияТабличнаяЧасть
	|ГДЕ
	|	РеализацияТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон";
Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Если ТипЗнч(Продукция) = Тип("СписокЗначений") Тогда
	Запрос.Текст = Запрос.Текст +  " И РеализацияТабличнаяЧасть.Товар В(&СписокТоваров)";
	Запрос.УстановитьПараметр("СписокТоваров",Продукция);
	Иначе
	Запрос.Текст = Запрос.Текст +  " И РеализацияТабличнаяЧасть.Товар = &Товар";	
	Запрос.УстановитьПараметр("Товар",Продукция);
	КонецЕсли; 
Результат = Запрос.Выполнить();
Количество = 0;
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
Возврат(Количество);
КонецФункции 

&НаСервере
Функция ПечатьППСВыпускомНаСервере()
Запрос = Новый Запрос;
ТабДок = Новый ТабличныйДокумент; 
СЗ = Новый СписокЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ПерспективныйПланСВыпуском");
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");

ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
	|	ПланыВыпускаОбороты.Период КАК Период,
	|	ПланыВыпускаОбороты.КоличествоРасход
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Обороты(, , Месяц, ) КАК ПланыВыпускаОбороты
	|ГДЕ
	|	ПланыВыпускаОбороты.Номенклатура В(&СписокНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыВыпускаОбороты.Номенклатура,
	|	ПланыВыпускаОбороты.Период,
	|	ПланыВыпускаОбороты.КоличествоРасход";
Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
	ОблСтрока.Параметры.Проект = СокрЛП(ТЧ.Проект.Наименование);	
	ТабДок.Вывести(ОблСтрока);
		Для Каждого Стр Из СЗ Цикл	
		НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
		ОблСтрокаПериод.Параметры.Кол = ТЧ["Д"+НомСтр];
		КолВыпущено = 0;
		ВыборкаДетальныеЗаписи.Сбросить();
			Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Номенклатура,Период",ТЧ.Номенклатура,Стр.Значение)) Цикл
			КолВыпущено = КолВыпущено + ВыборкаДетальныеЗаписи.КоличествоРасход;
			КонецЦикла;
		ОблСтрокаПериод.Параметры.КолВыпущено = КолВыпущено;
		ОблСтрокаПериод.Параметры.КолРеализация = ПолучитьКоличествоРеализаций(ТЧ.Номенклатура,Стр.Значение);
		ОблСтрокаПериод.Параметры.КолРазница = ОблСтрокаПериод.Параметры.Кол - ОблСтрокаПериод.Параметры.КолРеализация;
		ТабДок.Присоединить(ОблСтрокаПериод);
		КонецЦикла;			
	КонецЦикла;
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
ТабДок.Вывести(ОблКонец);
	Для Каждого Стр Из СЗ Цикл
	НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
	ОблКонецПериод.Параметры.КолВсего = ЭтаФорма.Номенклатура.Итог("Д"+НомСтр);
	КолВыпущеноВсего = 0;
	ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Период",Стр.Значение)) Цикл
		КолВыпущеноВсего = КолВыпущеноВсего + ВыборкаДетальныеЗаписи.КоличествоРасход;
		КонецЦикла;
	ОблКонецПериод.Параметры.КолВыпущеноВсего = КолВыпущеноВсего;
	ОблКонецПериод.Параметры.КолРеализацияВсего = ПолучитьКоличествоРеализаций(СписокНоменклатуры,Стр.Значение);
	ОблКонецПериод.Параметры.КолРазницаВсего = ОблКонецПериод.Параметры.КолВсего - ОблКонецПериод.Параметры.КолРеализацияВсего;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
Возврат(ТабДок);
КонецФункции

&НаСервере
Функция ПечатьППСоСписаниемНаСервере()
Запрос = Новый Запрос;
ТабДок = Новый ТабличныйДокумент; 
СЗ = Новый СписокЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ПерспективныйПланСВыпуском");
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");

ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.МПЗ КАК МПЗ,
	|	НАЧАЛОПЕРИОДА(МестаХраненияОбороты.Период, МЕСЯЦ) КАК Период,
	|	МестаХраненияОбороты.КоличествоРасход КАК КоличествоРасход,
	|	МестаХраненияОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
	|ГДЕ
	|	МестаХраненияОбороты.МПЗ В(&СписокНоменклатуры)
	|	И ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор) = ТИП(Документ.СписаниеМПЗПрочее)
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаХраненияОбороты.МПЗ,
	|	МестаХраненияОбороты.КоличествоРасход,
	|	МестаХраненияОбороты.Регистратор,
	|	НАЧАЛОПЕРИОДА(МестаХраненияОбороты.Период, МЕСЯЦ)
	|ИТОГИ
	|	СУММА(КоличествоРасход)
	|ПО
	|	Период ПЕРИОДАМИ(МЕСЯЦ, , )";
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
	ОблСтрока.Параметры.Проект = СокрЛП(ТЧ.Проект.Наименование);	
	ТабДок.Вывести(ОблСтрока);
		Для Каждого Стр Из СЗ Цикл	
		НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
		ОблСтрокаПериод.Параметры.Кол = ТЧ["Д"+НомСтр];
		КолВыпущено = 0;
		ВыборкаДетальныеЗаписи.Сбросить();
			Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("МПЗ,Период",ТЧ.Номенклатура,Стр.Значение)) Цикл
			КолВыпущено = КолВыпущено + ВыборкаДетальныеЗаписи.КоличествоРасход;
			КонецЦикла;
		ОблСтрокаПериод.Параметры.КолВыпущено = КолВыпущено;
		ОблСтрокаПериод.Параметры.КолРеализация = ПолучитьКоличествоРеализаций(ТЧ.Номенклатура,Стр.Значение);
		ОблСтрокаПериод.Параметры.КолРазница = ОблСтрокаПериод.Параметры.Кол - ОблСтрокаПериод.Параметры.КолРеализация;
		ТабДок.Присоединить(ОблСтрокаПериод);
		КонецЦикла;			
	КонецЦикла;
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
ТабДок.Вывести(ОблКонец);
	Для Каждого Стр Из СЗ Цикл
	НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
	ОблКонецПериод.Параметры.КолВсего = ЭтаФорма.Номенклатура.Итог("Д"+НомСтр);
	КолВыпущеноВсего = 0;
	ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Период",Стр.Значение)) Цикл
		КолВыпущеноВсего = КолВыпущеноВсего + ВыборкаДетальныеЗаписи.КоличествоРасход;
		КонецЦикла;
	ОблКонецПериод.Параметры.КолВыпущеноВсего = КолВыпущеноВсего;
	ОблКонецПериод.Параметры.КолРеализацияВсего = ПолучитьКоличествоРеализаций(СписокНоменклатуры,Стр.Значение);
	ОблКонецПериод.Параметры.КолРазницаВсего = ОблКонецПериод.Параметры.КолВсего - ОблКонецПериод.Параметры.КолРеализацияВсего;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьППСВыпуском(Команда)
	Если ТипСправочника = 1 Тогда
	ТД = ПечатьППСоСписаниемНаСервере();
	Иначе	
	ТД = ПечатьППСВыпускомНаСервере();	
	КонецЕсли; 
ТД.Показать("Помесячный перспективный план с выпуском");
ТД.ФиксацияСверху = 4;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаСервере
Функция ПечатьППНаСервере(ВидОтчёта)
ТабДок = Новый ТабличныйДокумент; 
СЗ = Новый СписокЗначений;

Макет = Обработки.ПерспективныеПланы.ПолучитьМакет("ПерспективныйПлан"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
	Если ТипСправочника = 1 Тогда
	ОблШапкаЦена = Макет.ПолучитьОбласть("Шапка|Цена");
	ОблСтрокаЦена = Макет.ПолучитьОбласть("Строка|Цена");
	ОблКонецЦена = Макет.ПолучитьОбласть("Конец|Цена");
	КонецЕсли; 
		Если ВидОтчёта = 0 Тогда
		ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");	
		ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
		ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
		ИначеЕсли ВидОтчёта = 1 Тогда
		ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|ПериодПП");	
		ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|ПериодПП");
		ОблКонецПериод = Макет.ПолучитьОбласть("Конец|ПериодПП");
		ИначеЕсли ВидОтчёта = 2 Тогда
		ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|ПериодРП");	
		ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|ПериодРП");
		ОблКонецПериод = Макет.ПолучитьОбласть("Конец|ПериодРП");
		ИначеЕсли ВидОтчёта = 3 Тогда
		ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|ПериодРК");	
		ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|ПериодРК");
		ОблКонецПериод = Макет.ПолучитьОбласть("Конец|ПериодРК");
		КонецЕсли; 
ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
	Если ТипСправочника = 1 Тогда
	ТабДок.Присоединить(ОблШапкаЦена);
	КонецЕсли;
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
		Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
		ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
		ОблСтрока.Параметры.Изделие = ТЧ.Номенклатура;
		ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
			Если ТипСправочника = 2 Тогда
			ОблСтрока.Параметры.Линейка = СокрЛП(ТЧ.Номенклатура.Линейка.Наименование);
			КонецЕсли;
		ОблСтрока.Параметры.Проект = СокрЛП(ТЧ.Проект.Наименование);
		//ОблСтрока.Параметры.ПиковыеПродажи = ТЧ.ПиковыеПродажи;
		ТабДок.Вывести(ОблСтрока); 
			Если ТипСправочника = 1 Тогда
			ОблСтрокаЦена.Параметры.Цена = ТЧ.Цена;
			ТабДок.Присоединить(ОблСтрокаЦена);
			КонецЕсли;
		Отбор = Новый Структура("МПЗ",ТЧ.Номенклатура);
			Для Каждого Стр Из СЗ Цикл	
			НомСтр = Число(Стр.ПолучитьИдентификатор()+1);
				Если ВидОтчёта = 0 Тогда
				ОблСтрокаПериод.Параметры.Кол = ТЧ["Д"+НомСтр];
				ОблСтрокаПериод.Параметры.РезПриб = ТЧ["РП"+НомСтр];
				ОблСтрокаПериод.Параметры.РезКм = ТЧ["РК"+НомСтр];
				ИначеЕсли ВидОтчёта = 1 Тогда
				ОблСтрокаПериод.Параметры.Кол = ТЧ["Д"+НомСтр];
				ИначеЕсли ВидОтчёта = 2 Тогда
				ОблСтрокаПериод.Параметры.РезПриб = ТЧ["РП"+НомСтр];
				ИначеЕсли ВидОтчёта = 3 Тогда
				ОблСтрокаПериод.Параметры.РезКм = ТЧ["РК"+НомСтр]; 
				КонецЕсли;
			ТабДок.Присоединить(ОблСтрокаПериод);
			КонецЦикла;			
		КонецЦикла;
ТабДок.Вывести(ОблКонец);
	Если ТипСправочника = 1 Тогда
	ТабДок.Присоединить(ОблКонецЦена);
	КонецЕсли;
		Для Каждого Стр Из СЗ Цикл
			Если ВидОтчёта < 2 Тогда	
			ОблКонецПериод.Параметры.КолВсего = ЭтаФорма.Номенклатура.Итог("Д"+Число(Стр.ПолучитьИдентификатор()+1));
			КонецЕсли;
		ТабДок.Присоединить(ОблКонецПериод);
		КонецЦикла;	
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьПП_РП_РК(Команда)
ТД = ПечатьППНаСервере(0);
ТД.Показать("Помесячный перспективный план по продукции с резервами приборов и комплектов материалов");	
ТД.ФиксацияСверху = 4;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПП(Команда)
ТД = ПечатьППНаСервере(1);
ТД.Показать("Помесячный перспективный план");
ТД.ФиксацияСверху = 4;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРП(Команда)
ТД = ПечатьППНаСервере(2);
ТД.Показать("Помесячный план по резервам приборов по складам ГП");
ТД.ФиксацияСверху = 4;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРК(Команда)
ТД = ПечатьППНаСервере(3);
ТД.Показать("Помесячный план резервов комплектов материалов");
ТД.ФиксацияСверху = 4;
ТД.Вывод = ИспользованиеВывода.Авто;
КонецПроцедуры

&НаКлиенте
Процедура СписокПочтовойРассылкиПриИзменении(Элемент)
СписокПочтовойРассылкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПочтовойРассылкиПриИзмененииНаСервере()
ХранилищеОбщихНастроек.Сохранить("СписокРассылкиПоПерспективнымПланам", "СписокПочтовойРассылки", СписокПочтовойРассылки);
КонецПроцедуры

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылка(ТабДок,ДатаНачала,ДатаОкончания)
	Если СписокПочтовойРассылки.Количество() = 0 Тогда
	Сообщить("Нет списка почтовой рассылки!");
	Возврат;
	КонецЕсли;
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника; 
	Для каждого Стр Из СписокПочтовойРассылки Цикл
    Сообщение.Получатели.Добавить(ПолучитьEmailПолучателя(Стр.Значение));
	КонецЦикла; 
Сообщение.Отправитель.Адрес = EmailСотрудника;
	Если ТабДок = Неопределено Тогда
	Сообщение.Тема = "Загружен перспективный план за "+Формат(ДатаНачала,"ДФ=dd.MM.yyyy"); 
	Текст = "Здравствуйте!";
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "Загружен перспективный план с "+ДатаНачала+" по "+ДатаОкончания;
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "С уважением, email: "+EmailСотрудника;
	Сообщение.Тексты.Добавить(Текст);	
	Иначе	
	Сообщение.Тема = "В перспективном плане произошли изменения!"; 
	Текст = "Здравствуйте!";
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "В перспективном плане произошли изменения!";	
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "С уважением, email: "+EmailСотрудника;
	Сообщение.Тексты.Добавить(Текст);	
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	Сообщение.Вложения.Добавить(ИмяФайла,"Изменение помесячных перспективных планов за период");
	КонецЕсли; 	
// Подключиться и отправить. 
Почта = Новый ИнтернетПочта; 
Почта.Подключиться(ИПП);
Почта.Послать(Сообщение); 
Почта.Отключиться();
ПоказатьОповещениеПользователя("Сообщение отправлено!");	
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(Спецификация,КолУзла)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(Спецификация,ТекущаяДата());
	Пока НормРасх.Следующий() Цикл			
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы")Тогда
			Если ПолучитьСтатус(НормРасх.Элемент) = Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов Тогда	
			Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",НормРасх.Элемент));
				Если Выборка.Количество() = 0 Тогда			
				ТЧ = ТаблицаМПЗ.Добавить();
				ТЧ.МПЗ = НормРасх.Элемент;
				ТЧ.Количество = ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				КонецЕсли;				
			КонецЕсли; 					
		Иначе
		РаскрытьНаМПЗ(НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла); 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция АктуальностьПланированияНаСервере()
ТабДок = Новый ТабличныйДокумент; 
СЗ = Новый СписокЗначений;

Макет = Обработки.ПерспективныеПланы.ПолучитьМакет("АктуальностьПланирования"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблИзделие = Макет.ПолучитьОбласть("Изделие|Наименование");
ОблИзделиеПериод = Макет.ПолучитьОбласть("Изделие|Период");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ|Наименование");
ОблМПЗПериод = Макет.ПолучитьОбласть("МПЗ|Период");
ОблШапка.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
ЗапросПЗ = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.МПЗ КАК МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, ) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МестоХранения В(&СписокМестХранения)
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	МПЗ";
Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
Запрос.УстановитьПараметр("СписокМестХранения",СписокМестХранения);
Результат = Запрос.Выполнить();
ВыборкаМПЗ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СЗ.Добавить(ТекДата);
		ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy");
		ТабДок.Присоединить(ОблШапкаПериод);
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
		Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
		КолНезапущенныхПЗ = 0;
		ЗапросПЗ.Текст = 
			"ВЫБРАТЬ
			|	ПроизводственноеЗадание.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
			|ГДЕ
			|	ПроизводственноеЗадание.Изделие = &Изделие
			|ИТОГИ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
			|ПО
			|	ОБЩИЕ";
		ЗапросПЗ.УстановитьПараметр("Изделие",ТЧ.Номенклатура);
		Результат = ЗапросПЗ.Выполнить();
		ВыборкаПЗ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			Пока ВыборкаПЗ.Следующий() Цикл
			КолНезапущенныхПЗ = ВыборкаПЗ.Ссылка;
			КонецЦикла; 
		ОблИзделие.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Наименование);
		ОблИзделие.Параметры.Изделие = ТЧ.Номенклатура;
		ОблИзделие.Параметры.Статус = ПолучитьСтатус(ТЧ.Номенклатура);
		ОблИзделие.Параметры.КолНезапущенныхПЗ = КолНезапущенныхПЗ;
		ТабДок.Вывести(ОблИзделие);
			Для Каждого Стр Из СЗ Цикл	
			ОблИзделиеПериод.Параметры.Кол = ТЧ["Д"+Число(Стр.ПолучитьИдентификатор()+1)];
			ТабДок.Присоединить(ОблИзделиеПериод);
			КонецЦикла;
		ТаблицаМПЗ.Очистить();
		РаскрытьНаМПЗ(ТЧ.Номенклатура,1);
			Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл	
			ВыборкаМПЗ.Сбросить();
	        ОблМПЗ.Параметры.Статус = ПолучитьСтатус(ТЧ_МПЗ.МПЗ);
	        ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ_МПЗ.МПЗ.Наименование);
	        ОблМПЗ.Параметры.МПЗ = ТЧ_МПЗ.МПЗ;
	        ОблМПЗ.Параметры.КолВИзделии = ТЧ_МПЗ.Количество;
				Если ВыборкаМПЗ.НайтиСледующий(Новый Структура("МПЗ",ТЧ_МПЗ.МПЗ)) Тогда
				ОблМПЗ.Параметры.КоличествоОстаток = ВыборкаМПЗ.КоличествоОстаток;
				Иначе
				ОблМПЗ.Параметры.КоличествоОстаток = 0;
				КонецЕсли;
			ОблМПЗ.Параметры.КолВНезапущенныхПЗ = ОблМПЗ.Параметры.КолВИзделии*КолНезапущенныхПЗ;
			ОблМПЗ.Параметры.КолМожноИзготовить = Окр((ОблМПЗ.Параметры.КоличествоОстаток-ОблМПЗ.Параметры.КолВНезапущенныхПЗ)/ОблМПЗ.Параметры.КолВИзделии,0,0);
			ТабДок.Вывести(ОблМПЗ);
				Для Каждого Стр Из СЗ Цикл
				ТабДок.Присоединить(ОблМПЗПериод);
				КонецЦикла;			
			КонецЦикла;		
		КонецЦикла;
ОблКонец = Макет.ПолучитьОбласть("Конец|Наименование");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
ТабДок.Вывести(ОблКонец);
	Для Каждого Стр Из СЗ Цикл
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура АктуальностьПланирования(Команда)
ТД = АктуальностьПланированияНаСервере();
ТД.Показать("Актуальность планирования");
ТД.Защита = Истина;
ТД.ФиксацияСверху = 4;      
КонецПроцедуры

&НаСервере
Процедура ОчиститьНоменклатуру()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
ТЗ.Очистить();	
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ТипПланаПриИзменении(Элемент)
Элементы.СписокПроектов.Видимость = ТипПлана;
Элементы.РезервКомплектовМПЗ.Видимость = Не ТипПлана; 
Элементы.РезервПриборов.Видимость = Не ТипПлана;
Элементы.СортироватьПо.Видимость = ТипПлана;
Элементы.ВыбратьВсе.Видимость = ТипПлана;
Элементы.ОтменитьВсе.Видимость = ТипПлана;
Элементы.ОбнулитьПомеченные.Видимость = ТипПлана;
	Если ТипПлана Тогда
	РезервКомплектовМПЗ = Ложь;
	РезервПриборов = Ложь;
	Иначе
	СортироватьПо = 1;
	КонецЕсли;
		Если Элементы.Найти("Номенклатура") <> Неопределено Тогда
		ОчиститьНоменклатуру();
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПиковыеПродажиНаСервере(Наименование,ПиковыеПродажи)
	Если ТипСправочника = 1 Тогда	
	МПЗ = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Иначе
	МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	КонецЕсли;
		Если Не МПЗ.Пустая() Тогда
			Если МПЗ.ПиковыеПродажи <> ПиковыеПродажи Тогда
			МПЗОбъект = МПЗ.ПолучитьОбъект();
			МПЗОбъект.ПиковыеПродажи = ПиковыеПродажи;
			МПЗОбъект.Записать();
			КонецЕсли;
		Иначе	
		Сообщить(Наименование + " - не найдено в справочнике!");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПиковыеПродажи(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c пиковыми продажами");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка пиковых продаж из файла..."); 
        ЗагрузитьПиковыеПродажиНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайла(Наименование)
	Если ТипСправочника = 1 Тогда
	Выборка = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Иначе	
	Выборка = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	КонецЕсли; 
		Если Не Выборка.Пустая() Тогда
			Если ТипСправочника = 1 Тогда
			СписокГруппМатериалов.Добавить(Выборка);
			Иначе
		    СписокГруппНоменклатуры.Добавить(Выборка);
			КонецЕсли;
		Иначе	
		Сообщить(Наименование+" - не найден в справочнике!");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл со списком");
	Если Результат <> Неопределено Тогда
	СписокТоваров = Новый СписокЗначений;
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка из списка...");
		ЗагрузитьИзФайла(СокрЛП(ExcelЛист.Cells(к,1).Value));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
	ТЧ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого ТЧ Из ЭтаФорма.Номенклатура Цикл
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
